import random

textlist = [
    "الولد مريض.",
    "الطائر فوق الشجرة.",
    "البستان جميل.",
    "قطف محمد زهرة.",
    "الشمس طالعة.",
    "شم علي وردة.",
    "يعيش السمك في الماء.",
    "يكثر النخيل في مصر.",
    "السماء ممطرة.",
    "الحديقة جميلة.",
    "يقطف علي الأزهار.",
    "يلعب الغلمان بالكرة.",
    "أهم ميزة لمشكال أنه يقترح تشكيلا آليا للنص.",
    "تشكيل النصوص العربية أهم مسائل معالجة اللغة العربية."
]

def random_text() -> str:
    """إرجاع نص عشوائي للاختبار"""
    return random.choice(textlist)
